zengwangfa/Underwater-Vehicle/software/18.8.21最终)/Chip/inc/kinetis/MK50DZ10.h
/** I2S - Peripheral register structure */
typedef struct I2S_MemMap {
  uint32_t TX0;                                    /**< I2S Transmit Data Registers 0, offset: 0x0 */
  uint32_t TX1;                                    /**< I2S Transmit Data Registers 1, offset: 0x4 */
  uint32_t RX0;                                    /**< I2S Receive Data Registers 0, offset: 0x8 */
  uint32_t RX1;                                    /**< I2S Receive Data Registers 1, offset: 0xC */
  uint32_t CR;                                     /**< I2S Control Register, offset: 0x10 */
  uint32_t ISR;                                    /**< I2S Interrupt Status Register, offset: 0x14 */
  uint32_t IER;                                    /**< I2S Interrupt Enable Register, offset: 0x18 */
  uint32_t TCR;                                    /**< I2S Transmit Configuration Register, offset: 0x1C */
  uint32_t RCR;                                    /**< I2S Receive Configuration Register, offset: 0x20 */
  uint32_t TCCR;                                   /**< I2S Transmit Clock Control Registers, offset: 0x24 */
  uint32_t RCCR;                                   /**< I2S Receive Clock Control Registers, offset: 0x28 */
  uint32_t FCSR;                                   /**< I2S FIFO Control/Status Register, offset: 0x2C */
  uint8_t RESERVED_0[8];
  uint32_t ACNT;                                   /**< I2S AC97 Control Register, offset: 0x38 */
  uint32_t ACADD;                                  /**< I2S AC97 Command Address Register, offset: 0x3C */
  uint32_t ACDAT;                                  /**< I2S AC97 Command Data Register, offset: 0x40 */
  uint32_t ATAG;                                   /**< I2S AC97 Tag Register, offset: 0x44 */
  uint32_t TMSK;                                   /**< I2S Transmit Time Slot Mask Register, offset: 0x48 */
  uint32_t RMSK;                                   /**< I2S Receive Time Slot Mask Register, offset: 0x4C */
  uint32_t ACCST;                                  /**< I2S AC97 Channel Status Register, offset: 0x50 */
  uint32_t ACCEN;                                  /**< I2S AC97 Channel Enable Register, offset: 0x54 */
  uint32_t ACCDIS;                                 /**< I2S AC97 Channel Disable Register, offset: 0x58 */
} volatile *I2S_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- I2S - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup I2S_Register_Accessor_Macros I2S - Register accessor macros
 * @{
 */


/* I2S - Register accessors */
#define I2S_TX0_REG(base)                        ((base)->TX0)
#define I2S_TX1_REG(base)                        ((base)->TX1)
#define I2S_RX0_REG(base)                        ((base)->RX0)
#define I2S_RX1_REG(base)                        ((base)->RX1)
#define I2S_CR_REG(base)                         ((base)->CR)
#define I2S_ISR_REG(base)                        ((base)->ISR)
#define I2S_IER_REG(base)                        ((base)->IER)
#define I2S_TCR_REG(base)                        ((base)->TCR)
#define I2S_RCR_REG(base)                        ((base)->RCR)
#define I2S_TCCR_REG(base)                       ((base)->TCCR)
#define I2S_RCCR_REG(base)                       ((base)->RCCR)
#define I2S_FCSR_REG(base)                       ((base)->FCSR)
#define I2S_ACNT_REG(base)                       ((base)->ACNT)
#define I2S_ACADD_REG(base)                      ((base)->ACADD)
#define I2S_ACDAT_REG(base)                      ((base)->ACDAT)
#define I2S_ATAG_REG(base)                       ((base)->ATAG)
#define I2S_TMSK_REG(base)                       ((base)->TMSK)
#define I2S_RMSK_REG(base)                       ((base)->RMSK)
#define I2S_ACCST_REG(base)                      ((base)->ACCST)
#define I2S_ACCEN_REG(base)                      ((base)->ACCEN)
#define I2S_ACCDIS_REG(base)                     ((base)->ACCDIS)

/**
 * @}
 */ /* end of group I2S_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- I2S Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup I2S_Register_Masks I2S Register Masks
 * @{
 */

/* TX0 Bit Fields */
#define I2S_TX0_TX0_MASK                         0xFFFFFFFFu
#define I2S_TX0_TX0_SHIFT                        0
#define I2S_TX0_TX0(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_TX0_TX0_SHIFT))&I2S_TX0_TX0_MASK)
/* TX1 Bit Fields */
#define I2S_TX1_TX1_MASK                         0xFFFFFFFFu
#define I2S_TX1_TX1_SHIFT                        0
#define I2S_TX1_TX1(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_TX1_TX1_SHIFT))&I2S_TX1_TX1_MASK)
/* RX0 Bit Fields */
#define I2S_RX0_RX0_MASK                         0xFFFFFFFFu
#define I2S_RX0_RX0_SHIFT                        0
#define I2S_RX0_RX0(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_RX0_RX0_SHIFT))&I2S_RX0_RX0_MASK)
/* RX1 Bit Fields */
#define I2S_RX1_RX1_MASK                         0xFFFFFFFFu
#define I2S_RX1_RX1_SHIFT                        0
#define I2S_RX1_RX1(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_RX1_RX1_SHIFT))&I2S_RX1_RX1_MASK)
/* CR Bit Fields */
#define I2S_CR_I2SEN_MASK                        0x1u
#define I2S_CR_I2SEN_SHIFT                       0
#define I2S_CR_TE_MASK                           0x2u
#define I2S_CR_TE_SHIFT                          1
#define I2S_CR_RE_MASK                           0x4u
#define I2S_CR_RE_SHIFT                          2
#define I2S_CR_NET_MASK                          0x8u
#define I2S_CR_NET_SHIFT                         3
#define I2S_CR_SYN_MASK                          0x10u
#define I2S_CR_SYN_SHIFT                         4
#define I2S_CR_I2SMODE_MASK                      0x60u
#define I2S_CR_I2SMODE_SHIFT                     5
#define I2S_CR_I2SMODE(x)                        (((uint32_t)(((uint32_t)(x))<<I2S_CR_I2SMODE_SHIFT))&I2S_CR_I2SMODE_MASK)
#define I2S_CR_SYSCLKEN_MASK                     0x80u
#define I2S_CR_SYSCLKEN_SHIFT                    7
#define I2S_CR_TCHEN_MASK                        0x100u
#define I2S_CR_TCHEN_SHIFT                       8
#define I2S_CR_CLKIST_MASK                       0x200u
#define I2S_CR_CLKIST_SHIFT                      9
#define I2S_CR_TFRCLKDIS_MASK                    0x400u
#define I2S_CR_TFRCLKDIS_SHIFT                   10
#define I2S_CR_RFRCLKDIS_MASK                    0x800u
#define I2S_CR_RFRCLKDIS_SHIFT                   11
#define I2S_CR_SYNCTXFS_MASK                     0x1000u
#define I2S_CR_SYNCTXFS_SHIFT                    12
/* ISR Bit Fields */
#define I2S_ISR_TFE0_MASK                        0x1u
#define I2S_ISR_TFE0_SHIFT                       0
#define I2S_ISR_TFE1_MASK                        0x2u
#define I2S_ISR_TFE1_SHIFT                       1
#define I2S_ISR_RFF0_MASK                        0x4u
#define I2S_ISR_RFF0_SHIFT                       2
#define I2S_ISR_RFF1_MASK                        0x8u
#define I2S_ISR_RFF1_SHIFT                       3
#define I2S_ISR_RLS_MASK                         0x10u
#define I2S_ISR_RLS_SHIFT                        4
#define I2S_ISR_TLS_MASK                         0x20u
#define I2S_ISR_TLS_SHIFT                        5
#define I2S_ISR_RFS_MASK                         0x40u
#define I2S_ISR_RFS_SHIFT                        6
#define I2S_ISR_TFS_MASK                         0x80u
#define I2S_ISR_TFS_SHIFT                        7
#define I2S_ISR_TUE0_MASK                        0x100u
#define I2S_ISR_TUE0_SHIFT                       8
#define I2S_ISR_TUE1_MASK                        0x200u
#define I2S_ISR_TUE1_SHIFT                       9
#define I2S_ISR_ROE0_MASK                        0x400u
#define I2S_ISR_ROE0_SHIFT                       10
#define I2S_ISR_ROE1_MASK                        0x800u
#define I2S_ISR_ROE1_SHIFT                       11
#define I2S_ISR_TDE0_MASK                        0x1000u
#define I2S_ISR_TDE0_SHIFT                       12
#define I2S_ISR_TDE1_MASK                        0x2000u
#define I2S_ISR_TDE1_SHIFT                       13
#define I2S_ISR_RDR0_MASK                        0x4000u
#define I2S_ISR_RDR0_SHIFT                       14
#define I2S_ISR_RDR1_MASK                        0x8000u
#define I2S_ISR_RDR1_SHIFT                       15
#define I2S_ISR_RXT_MASK                         0x10000u
#define I2S_ISR_RXT_SHIFT                        16
#define I2S_ISR_CMDDU_MASK                       0x20000u
#define I2S_ISR_CMDDU_SHIFT                      17
#define I2S_ISR_CMDAU_MASK                       0x40000u
#define I2S_ISR_CMDAU_SHIFT                      18
#define I2S_ISR_TRFC_MASK                        0x800000u
#define I2S_ISR_TRFC_SHIFT                       23
#define I2S_ISR_RFRC_MASK                        0x1000000u
#define I2S_ISR_RFRC_SHIFT                       24
/* IER Bit Fields */
#define I2S_IER_TFE0EN_MASK                      0x1u
#define I2S_IER_TFE0EN_SHIFT                     0
#define I2S_IER_TFE1EN_MASK                      0x2u
#define I2S_IER_TFE1EN_SHIFT                     1
#define I2S_IER_RFF0EN_MASK                      0x4u
#define I2S_IER_RFF0EN_SHIFT                     2
#define I2S_IER_RFF1EN_MASK                      0x8u
#define I2S_IER_RFF1EN_SHIFT                     3
#define I2S_IER_RLSEN_MASK                       0x10u
#define I2S_IER_RLSEN_SHIFT                      4
#define I2S_IER_TLSEN_MASK                       0x20u
#define I2S_IER_TLSEN_SHIFT                      5
#define I2S_IER_RFSEN_MASK                       0x40u
#define I2S_IER_RFSEN_SHIFT                      6
#define I2S_IER_TFSEN_MASK                       0x80u
#define I2S_IER_TFSEN_SHIFT                      7
#define I2S_IER_TUE0EN_MASK                      0x100u
#define I2S_IER_TUE0EN_SHIFT                     8
#define I2S_IER_TUE1EN_MASK                      0x200u
#define I2S_IER_TUE1EN_SHIFT                     9
#define I2S_IER_ROE0EN_MASK                      0x400u
#define I2S_IER_ROE0EN_SHIFT                     10
#define I2S_IER_ROE1EN_MASK                      0x800u
#define I2S_IER_ROE1EN_SHIFT                     11
#define I2S_IER_TDE0EN_MASK                      0x1000u
#define I2S_IER_TDE0EN_SHIFT                     12
#define I2S_IER_TDE1EN_MASK                      0x2000u
#define I2S_IER_TDE1EN_SHIFT                     13
#define I2S_IER_RDR0EN_MASK                      0x4000u
#define I2S_IER_RDR0EN_SHIFT                     14
#define I2S_IER_RDR1EN_MASK                      0x8000u
#define I2S_IER_RDR1EN_SHIFT                     15
#define I2S_IER_RXTEN_MASK                       0x10000u
#define I2S_IER_RXTEN_SHIFT                      16
#define I2S_IER_CMDDUEN_MASK                     0x20000u
#define I2S_IER_CMDDUEN_SHIFT                    17
#define I2S_IER_CMDAUEN_MASK                     0x40000u
#define I2S_IER_CMDAUEN_SHIFT                    18
#define I2S_IER_TIE_MASK                         0x80000u
#define I2S_IER_TIE_SHIFT                        19
#define I2S_IER_TDMAE_MASK                       0x100000u
#define I2S_IER_TDMAE_SHIFT                      20
#define I2S_IER_RIE_MASK                         0x200000u
#define I2S_IER_RIE_SHIFT                        21
#define I2S_IER_RDMAE_MASK                       0x400000u
#define I2S_IER_RDMAE_SHIFT                      22
#define I2S_IER_TFRC_EN_MASK                     0x800000u
#define I2S_IER_TFRC_EN_SHIFT                    23
#define I2S_IER_RFRC_EN_MASK                     0x1000000u
#define I2S_IER_RFRC_EN_SHIFT                    24
/* TCR Bit Fields */
#define I2S_TCR_TEFS_MASK                        0x1u
#define I2S_TCR_TEFS_SHIFT                       0
#define I2S_TCR_TFSL_MASK                        0x2u
#define I2S_TCR_TFSL_SHIFT                       1
#define I2S_TCR_TFSI_MASK                        0x4u
#define I2S_TCR_TFSI_SHIFT                       2
#define I2S_TCR_TSCKP_MASK                       0x8u
#define I2S_TCR_TSCKP_SHIFT                      3
#define I2S_TCR_TSHFD_MASK                       0x10u
#define I2S_TCR_TSHFD_SHIFT                      4
#define I2S_TCR_TXDIR_MASK                       0x20u
#define I2S_TCR_TXDIR_SHIFT                      5
#define I2S_TCR_TFDIR_MASK                       0x40u
#define I2S_TCR_TFDIR_SHIFT                      6
#define I2S_TCR_TFEN0_MASK                       0x80u
#define I2S_TCR_TFEN0_SHIFT                      7
#define I2S_TCR_TFEN1_MASK                       0x100u
#define I2S_TCR_TFEN1_SHIFT                      8
#define I2S_TCR_TXBIT0_MASK                      0x200u
#define I2S_TCR_TXBIT0_SHIFT                     9
/* RCR Bit Fields */
#define I2S_RCR_REFS_MASK                        0x1u
#define I2S_RCR_REFS_SHIFT                       0
#define I2S_RCR_RFSL_MASK                        0x2u
#define I2S_RCR_RFSL_SHIFT                       1
#define I2S_RCR_RFSI_MASK                        0x4u
#define I2S_RCR_RFSI_SHIFT                       2
#define I2S_RCR_RSCKP_MASK                       0x8u
#define I2S_RCR_RSCKP_SHIFT                      3
#define I2S_RCR_RSHFD_MASK                       0x10u
#define I2S_RCR_RSHFD_SHIFT                      4
#define I2S_RCR_RXDIR_MASK                       0x20u
#define I2S_RCR_RXDIR_SHIFT                      5
#define I2S_RCR_RFDIR_MASK                       0x40u
#define I2S_RCR_RFDIR_SHIFT                      6
#define I2S_RCR_RFEN0_MASK                       0x80u
#define I2S_RCR_RFEN0_SHIFT                      7
#define I2S_RCR_RFEN1_MASK                       0x100u
#define I2S_RCR_RFEN1_SHIFT                      8
#define I2S_RCR_RXBIT0_MASK                      0x200u
#define I2S_RCR_RXBIT0_SHIFT                     9
#define I2S_RCR_RXEXT_MASK                       0x400u
#define I2S_RCR_RXEXT_SHIFT                      10
/* TCCR Bit Fields */
#define I2S_TCCR_PM_MASK                         0xFFu
#define I2S_TCCR_PM_SHIFT                        0
#define I2S_TCCR_PM(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_TCCR_PM_SHIFT))&I2S_TCCR_PM_MASK)
#define I2S_TCCR_DC_MASK                         0x1F00u
#define I2S_TCCR_DC_SHIFT                        8
#define I2S_TCCR_DC(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_TCCR_DC_SHIFT))&I2S_TCCR_DC_MASK)
#define I2S_TCCR_WL_MASK                         0x1E000u
#define I2S_TCCR_WL_SHIFT                        13
#define I2S_TCCR_WL(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_TCCR_WL_SHIFT))&I2S_TCCR_WL_MASK)
#define I2S_TCCR_PSR_MASK                        0x20000u
#define I2S_TCCR_PSR_SHIFT                       17
#define I2S_TCCR_DIV2_MASK                       0x40000u
#define I2S_TCCR_DIV2_SHIFT                      18
/* RCCR Bit Fields */
#define I2S_RCCR_PM_MASK                         0xFFu
#define I2S_RCCR_PM_SHIFT                        0
#define I2S_RCCR_PM(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_RCCR_PM_SHIFT))&I2S_RCCR_PM_MASK)
#define I2S_RCCR_DC_MASK                         0x1F00u
#define I2S_RCCR_DC_SHIFT                        8
#define I2S_RCCR_DC(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_RCCR_DC_SHIFT))&I2S_RCCR_DC_MASK)
#define I2S_RCCR_WL_MASK                         0x1E000u
#define I2S_RCCR_WL_SHIFT                        13
#define I2S_RCCR_WL(x)                           (((uint32_t)(((uint32_t)(x))<<I2S_RCCR_WL_SHIFT))&I2S_RCCR_WL_MASK)
#define I2S_RCCR_PSR_MASK                        0x20000u
#define I2S_RCCR_PSR_SHIFT                       17
#define I2S_RCCR_DIV2_MASK                       0x40000u
#define I2S_RCCR_DIV2_SHIFT                      18
/* FCSR Bit Fields */
#define I2S_FCSR_TFWM0_MASK                      0xFu
#define I2S_FCSR_TFWM0_SHIFT                     0
#define I2S_FCSR_TFWM0(x)                        (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_TFWM0_SHIFT))&I2S_FCSR_TFWM0_MASK)
#define I2S_FCSR_RFWM0_MASK                      0xF0u
#define I2S_FCSR_RFWM0_SHIFT                     4
#define I2S_FCSR_RFWM0(x)                        (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_RFWM0_SHIFT))&I2S_FCSR_RFWM0_MASK)
#define I2S_FCSR_TFCNT0_MASK                     0xF00u
#define I2S_FCSR_TFCNT0_SHIFT                    8
#define I2S_FCSR_TFCNT0(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_TFCNT0_SHIFT))&I2S_FCSR_TFCNT0_MASK)
#define I2S_FCSR_RFCNT0_MASK                     0xF000u
#define I2S_FCSR_RFCNT0_SHIFT                    12
#define I2S_FCSR_RFCNT0(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_RFCNT0_SHIFT))&I2S_FCSR_RFCNT0_MASK)
#define I2S_FCSR_TFWM1_MASK                      0xF0000u
#define I2S_FCSR_TFWM1_SHIFT                     16
#define I2S_FCSR_TFWM1(x)                        (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_TFWM1_SHIFT))&I2S_FCSR_TFWM1_MASK)
#define I2S_FCSR_RFWM1_MASK                      0xF00000u
#define I2S_FCSR_RFWM1_SHIFT                     20
#define I2S_FCSR_RFWM1(x)                        (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_RFWM1_SHIFT))&I2S_FCSR_RFWM1_MASK)
#define I2S_FCSR_TFCNT1_MASK                     0xF000000u
#define I2S_FCSR_TFCNT1_SHIFT                    24
#define I2S_FCSR_TFCNT1(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_TFCNT1_SHIFT))&I2S_FCSR_TFCNT1_MASK)
#define I2S_FCSR_RFCNT1_MASK                     0xF0000000u
#define I2S_FCSR_RFCNT1_SHIFT                    28
#define I2S_FCSR_RFCNT1(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_FCSR_RFCNT1_SHIFT))&I2S_FCSR_RFCNT1_MASK)
/* ACNT Bit Fields */
#define I2S_ACNT_AC97EN_MASK                     0x1u
#define I2S_ACNT_AC97EN_SHIFT                    0
#define I2S_ACNT_FV_MASK                         0x2u
#define I2S_ACNT_FV_SHIFT                        1
#define I2S_ACNT_TIF_MASK                        0x4u
#define I2S_ACNT_TIF_SHIFT                       2
#define I2S_ACNT_RD_MASK                         0x8u
#define I2S_ACNT_RD_SHIFT                        3
#define I2S_ACNT_WR_MASK                         0x10u
#define I2S_ACNT_WR_SHIFT                        4
#define I2S_ACNT_FRDIV_MASK                      0x7E0u
#define I2S_ACNT_FRDIV_SHIFT                     5
#define I2S_ACNT_FRDIV(x)                        (((uint32_t)(((uint32_t)(x))<<I2S_ACNT_FRDIV_SHIFT))&I2S_ACNT_FRDIV_MASK)
/* ACADD Bit Fields */
#define I2S_ACADD_ACADD_MASK                     0x7FFFFu
#define I2S_ACADD_ACADD_SHIFT                    0
#define I2S_ACADD_ACADD(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_ACADD_ACADD_SHIFT))&I2S_ACADD_ACADD_MASK)
/* ACDAT Bit Fields */
#define I2S_ACDAT_ACDAT_MASK                     0xFFFFFu
#define I2S_ACDAT_ACDAT_SHIFT                    0
#define I2S_ACDAT_ACDAT(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_ACDAT_ACDAT_SHIFT))&I2S_ACDAT_ACDAT_MASK)
/* ATAG Bit Fields */
#define I2S_ATAG_ATAG_MASK                       0xFFFFu
#define I2S_ATAG_ATAG_SHIFT                      0
#define I2S_ATAG_ATAG(x)                         (((uint32_t)(((uint32_t)(x))<<I2S_ATAG_ATAG_SHIFT))&I2S_ATAG_ATAG_MASK)
/* TMSK Bit Fields */
#define I2S_TMSK_TMSK_MASK                       0xFFFFFFFFu
#define I2S_TMSK_TMSK_SHIFT                      0
#define I2S_TMSK_TMSK(x)                         (((uint32_t)(((uint32_t)(x))<<I2S_TMSK_TMSK_SHIFT))&I2S_TMSK_TMSK_MASK)
/* RMSK Bit Fields */
#define I2S_RMSK_RMSK_MASK                       0xFFFFFFFFu
#define I2S_RMSK_RMSK_SHIFT                      0
#define I2S_RMSK_RMSK(x)                         (((uint32_t)(((uint32_t)(x))<<I2S_RMSK_RMSK_SHIFT))&I2S_RMSK_RMSK_MASK)
/* ACCST Bit Fields */
#define I2S_ACCST_ACCST_MASK                     0x3FFu
#define I2S_ACCST_ACCST_SHIFT                    0
#define I2S_ACCST_ACCST(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_ACCST_ACCST_SHIFT))&I2S_ACCST_ACCST_MASK)
/* ACCEN Bit Fields */
#define I2S_ACCEN_ACCEN_MASK                     0x3FFu
#define I2S_ACCEN_ACCEN_SHIFT                    0
#define I2S_ACCEN_ACCEN(x)                       (((uint32_t)(((uint32_t)(x))<<I2S_ACCEN_ACCEN_SHIFT))&I2S_ACCEN_ACCEN_MASK)
/* ACCDIS Bit Fields */
#define I2S_ACCDIS_ACCDIS_MASK                   0x3FFu
#define I2S_ACCDIS_ACCDIS_SHIFT                  0
#define I2S_ACCDIS_ACCDIS(x)                     (((uint32_t)(((uint32_t)(x))<<I2S_ACCDIS_ACCDIS_SHIFT))&I2S_ACCDIS_ACCDIS_MASK)

/**
 * @}
 */ /* end of group I2S_Register_Masks */


/* I2S - Peripheral instance base addresses */
/** Peripheral I2S0 base pointer */
#define I2S0_BASE_PTR                            ((I2S_MemMapPtr)0x4002F000u)

/* ----------------------------------------------------------------------------
   -- I2S - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup I2S_Register_Accessor_Macros I2S - Register accessor macros
 * @{
 */


/* I2S - Register instance definitions */
/* I2S0 */
#define I2S0_TX0                                 I2S_TX0_REG(I2S0_BASE_PTR)
#define I2S0_TX1                                 I2S_TX1_REG(I2S0_BASE_PTR)
#define I2S0_RX0                                 I2S_RX0_REG(I2S0_BASE_PTR)
#define I2S0_RX1                                 I2S_RX1_REG(I2S0_BASE_PTR)
#define I2S0_CR                                  I2S_CR_REG(I2S0_BASE_PTR)
#define I2S0_ISR                                 I2S_ISR_REG(I2S0_BASE_PTR)
#define I2S0_IER                                 I2S_IER_REG(I2S0_BASE_PTR)
#define I2S0_TCR                                 I2S_TCR_REG(I2S0_BASE_PTR)
#define I2S0_RCR                                 I2S_RCR_REG(I2S0_BASE_PTR)
#define I2S0_TCCR                                I2S_TCCR_REG(I2S0_BASE_PTR)
#define I2S0_RCCR                                I2S_RCCR_REG(I2S0_BASE_PTR)
#define I2S0_FCSR                                I2S_FCSR_REG(I2S0_BASE_PTR)
#define I2S0_ACNT                                I2S_ACNT_REG(I2S0_BASE_PTR)
#define I2S0_ACADD                               I2S_ACADD_REG(I2S0_BASE_PTR)
#define I2S0_ACDAT                               I2S_ACDAT_REG(I2S0_BASE_PTR)
#define I2S0_ATAG                                I2S_ATAG_REG(I2S0_BASE_PTR)
#define I2S0_TMSK                                I2S_TMSK_REG(I2S0_BASE_PTR)
#define I2S0_RMSK                                I2S_RMSK_REG(I2S0_BASE_PTR)
#define I2S0_ACCST                               I2S_ACCST_REG(I2S0_BASE_PTR)
#define I2S0_ACCEN                               I2S_ACCEN_REG(I2S0_BASE_PTR)
#define I2S0_ACCDIS                              I2S_ACCDIS_REG(I2S0_BASE_PTR)

/**
 * @}
 */ /* end of group I2S_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group I2S_Peripheral */


/* ----------------------------------------------------------------------------
   -- ITM
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup ITM_Peripheral ITM
 * @{
 */

